{"id":89212,"communityId":356,"institutionId":3557,"name":"Texas A&M Student Chapter of the American Meteorological Society","shortName":"TAMSCAMS","nameSortKey":"T","websiteKey":"tamscams","email":"btoy8@tamu.edu","description":"<p>TAMSCAMSNWA (TAMSCAMS), the Texas A&amp;M Student Chapter of the American Meteorological Society and National Weather Association, is a student organization bringing together anyone interested in meteorology and the atmospheric sciences.</p>\r\n<p>The objectives of TAMSCAMS are to provide educational and social meetings for all students of Texas A&amp;M University who are interested in meteorology in any of its phases or applications, to provide a forum for discussions of meteorology or other related topics of general interest, and to develop and disseminate knowledge of the atmospheric and related oceanic and hydrologic sciences and the advancement of their applications at the college level. The organization strives to promote the ideals of Texas A&amp;M University and acquaint the student body and the public with the science and applications of meteorology.</p>\r\n<p>Generally held the first Tuesday of each month, TAMSCAMS meetings feature guest speakers from the meteorology and atmospheric sciences fields, weather discussions, plus announcements about upcoming events and job opportunities. Other activities throughout the school year include field trips to television stations and weather facilities, social events, and community service projects such as Big Event and Aggie Replant.</p>\r\n<p>Membership is open to any student of Texas A&amp;M with an interest in meteorology. The only requirement for membership is the payment of dues. Members must have paid dues for the current semester in order to participate in field trips or other activities requiring funding.</p>\r\n<p>Two branches of the TAMSCAMS organization provide valuable experience and learning opportunities. Members of TASC, the Texas Aggie Storm Chasers, learn first hand how severe weather acts and enjoy the awesome and diverse displays of significant weather events. Chasers make every effort to report severe weather to the National Weather Service. Members must attend a mandatory safety seminar before being eligible to participate in a chase. For more information, visit the TASC website:&nbsp;<a href=\"https://www.facebook.com/texasaggiestormchasers/?fref=ts\">https://www.facebook.com/texasaggiestormchasers/?fref=ts</a></p>\r\n<p>Those interested in broadcasting should look into Texas A&amp;M Weather Broadcasting. This branch of TAMSCAMS provides students with essential forecasting and actual on-air experience for landing an internship or job. Students volunteer as forecasters and announcers for 90.9 FM KAMU and The Battalion. For more information, visit&nbsp;<a href=\"http://www.tamuweather.org/\">http://www.tamuweather.org/</a></p>\r\n<p>&nbsp;</p>","summary":"TAMSCAMS is a student chapter of the national American Meteorological Society. We provide educational and social meetings for all students of Texas A&M who are interested in meteorology, provide a forum for discussions of meteorology or other related t...","status":"Active","comment":null,"showJoin":true,"statusChangeDateTime":null,"startDate":"2013-07-01T00:00:00+00:00","endDate":null,"parentId":85092,"wallId":1302591,"discussionId":1302591,"groupTypeId":null,"organizationTypeId":2756,"cssConfigurationId":null,"deleted":false,"enableGoogleCalendar":false,"modifiedOn":"0001-01-01T00:00:00+00:00","socialMedia":{"ExternalWebsite":"http://www.met.tamu.edu/","FlickrUrl":"","GoogleCalendarUrl":"","GooglePlusUrl":"","InstagramUrl":"","LinkedInUrl":"","PinterestUrl":"","TumblrUrl":"","VimeoUrl":"","YoutubeUrl":"","FacebookUrl":"https://www.facebook.com/groups/394074280611522/","TwitterUrl":null,"TwitterUserName":""},"profilePicture":"96f9a813-dced-4a54-b3f0-a6d48ad9cea905372a64-ef7b-41ae-8ebe-459dbfa31e64.jpg","organizationType":{"id":2756,"name":"Registered - Recognized Student Organizations","autoApproveRequests":false,"showMembersToPublic":false,"showOfficersToPublic":true,"eventsEnabled":true,"serviceHoursEnabled":true,"financeEnabled":false,"reRegistrationAvailabilty":null,"electionsEnabled":true,"formsEnabled":true,"galleryEnabled":true,"outcomesEnabled":true,"rosterEnabled":true,"shownInPublicDirectory":true,"documentsEnabled":true,"isSystemType":false,"adminOnly":false},"primaryContact":{"id":"a4334b2e-5298-4639-825c-a6a101601b66","firstName":"Brittany","preferredFirstName":null,"lastName":"Toy","primaryEmailAddress":"btoy8@tamu.edu","profileImageFilePath":null,"institutionId":3557,"privacy":"Unselected"},"isBranch":false,"contactInfo":[{"id":166589,"addressType":0,"city":null,"country":null,"deleted":false,"extension":null,"faxNumber":null,"organizationId":89212,"phoneNumber":null,"state":null,"street1":null,"street2":null,"zip":null}],"legacyKey":null,"parentLegacyKey":null,"legacyPrimaryContactKey":null,"showFacebookWall":false,"showTwitterFeed":false,"submissions":[],"visibility":"Public","isShownInPublicDirectory":true,"isAdminOnly":false,"categories":[]}