{"id":106400,"communityId":356,"institutionId":3557,"name":"Patriot Paws of Aggieland","shortName":"","nameSortKey":"P","websiteKey":"37","email":"patriotpawsbcs@gmail.com","description":"<h1>Patriot Paws of Aggieland&nbsp;</h1>\r\n<p>Patriot Paws of Aggieland is a satellite program created through the teamwork between Patriot Paws trainers and the students at Texas A&amp;M. Patriot Paws of Aggieland works closely in conjunction with Patriot Paws to assist in the socialization, training, and overall raising of specialized service dogs to aid disabled veterans. Patriot Paws of Aggieland is honored to have the full support of Patriot Paws in becoming a recognized student organization.&nbsp;</p>\r\n<p>Learn more about Patriot Paws here!&nbsp;</p>\r\n<p><a title=\"www.patriotpaws.org\" href=\"http://www.patriotpaws.org/\">www.patriotpaws.org</a></p>\r\n<p>&nbsp;</p>\r\n<h1>Our Mission</h1>\r\n<p>The mission of Patriot Paws is to train and provide service dogs of the highest quality at no cost to disabled veterans in order to help restore their physical and emotional independence. Patriot Paws intends to build partnerships with the state and community organizations to help develop and support this goal.</p>\r\n<p>The mission of Patriot Paws of Aggieland is to illustrate the support we can provide to military personnel before and after they have served through the use of service animals. Patriot Paws of Aggieland assists in the training and socialization of future service&nbsp;dogs. Patriot Paws of Aggieland fundraises for, trains, and raises awareness of mobility assistance and post traumatic stress disorder (PTSD) service dogs.</p>\r\n<h1>&nbsp;</h1>\r\n<h1>Our History</h1>\r\n<p>Patriot Paws of Aggieland became an officially recognized student organization in Fall 2013, and held its first general meeting in February 2014. Patriot Paws Service Dogs organization was officially designated as a 501 (c) (3) organization in February 2006 and is a certified member of Assistance Dogs International (ADI). Patriot Paws trains service dogs to perform various disability-specific&nbsp;tasks. Patriot Paws' primary goal is to increase an individual&rsquo;s self-sufficiency through the assistance of a personalized service animal. The following are a list of some services provided to assist disabled veterans in accomplishing daily tasks that would otherwise be difficult or impossible:</p>\r\n<ul>\r\n<li>Get help in medical emergencies</li>\r\n<li>Recognize and avert PTSD episodes</li>\r\n<li>Pick up and retrieve items</li>\r\n<li>Open and close doors</li>\r\n<li>Pull wheelchairs</li>\r\n<li>Provide bracing to stand, walk, and sit down</li>\r\n<li>Help with chores, such as laundry</li>\r\n<li>Take off shoes and socks</li>\r\n</ul>\r\n<p>&nbsp;</p>\r\n<h1>Membership</h1>\r\n<p>We love our members! Membership is open to all Bryan/College Station community members, Texas A&amp;M students, and faculty.</p>\r\n<p>In order to become an active member of Patriot PAWS of Aggieland, you will need to:</p>\r\n<ul>\r\n<li>Pay $20 dues per semester no later than the second meeting of the semester. Dues pay for your PPA t-shirt, social events, and will help support our puppy raising program.</li>\r\n<li>Acquire 6 Paw Prints per semester. Members must acquire 3 general meeting Paw Prints, 2 profit share Paw Prints, and 1 social Paw Print each semester in order to be considered active.</li>\r\n<li>Veterans are not required to pay dues.</li>\r\n</ul>\r\n<p>If you have any questions about paying dues or becoming a member, please email us at&nbsp;<a>patriotpawsbcs@gmail.com</a>.</p>\r\n<p>&nbsp;</p>\r\n<h1 class=\"x_x_x_title\">PPA Member Positions</h1>\r\n<p>&nbsp;</p>\r\n<div class=\"x_x_x_row\">\r\n<div class=\"x_x_x_span9\">\r\n<div class=\"x_x_x_floating\">\r\n<div id=\"x_x_x_node-35\" class=\"x_x_x_node x_x_x_clear-block\">\r\n<div class=\"x_x_x_content\">\r\n<h1>What does it take to become a Raiser?</h1>\r\n<p>&nbsp;</p>\r\n<h1>Raisers</h1>\r\n<p>Raisers raise, train, and socialize our puppies for exactly one year starting at the age of 8 weeks. Raisers must&nbsp;must&nbsp;acquire 10 paw-prints per semester.</p>\r\n<p>In order to become a raiser, you will need to complete the following steps:</p>\r\n<ul>\r\n<li>Must attend all 10 PRIT Classes (Thursdays)</li>\r\n<li>Must attend 2 Outings per month (Sundays)</li>\r\n</ul>\r\n<p>If you have any questions about the raiser program, please send an email to&nbsp;patriotpawsbcs@gmail.com or contact a trainer at our general meetings.</p>\r\n<p>&nbsp;</p>\r\n<h1>PPA Officers</h1>\r\n<p>Officers help PPA run as smoothly as possible. In order to become an officer, you must be a student at Texas A&amp;M. All officer candidates will need to meet Texas A&amp;M GPR and enrollment requirements and be an active member of PPA. Elections are held at the second&nbsp;meeting of the semester when an officer position is available, except for the position of President or in special circumstances. In order to run for the position of president, the candidate must have previously served as an officer for one full semester.. The following is a brief overview of the responsibilities for each officer position.</p>\r\n<ul>\r\n<li>President - The president acts as a head figure for the organization, oversees all activity, leads general and officer meetings, and delegates responsibilities to officers.</li>\r\n</ul>\r\n<ul>\r\n<li>Administrative Coordinator - The administrative coordinator monitors the PPA Facebook page and email. He/she will help plan events, record member attendance, maintain the calendar and training shutterfly account, and represent Patriot Paws at public events.</li>\r\n</ul>\r\n<ul>\r\n<li>Treasurer - The treasurer collects dues, distributes and keeps inventory of t-shirts. He/she also works closely with the Student Organization Finance Center to manage the PPA organization account, including but not limited to deposits, withdrawals, reimbursements, and maintaining a ledger/budget.</li>\r\n</ul>\r\n<ul>\r\n<li>Fundraising Coordinator - The fundraising coordinator plans and organizes fundraisers such as profit shares and fundraising booths. He or she fulfills sponsorship levels with PPA donors to ensure they are properly thanked for their generosity.&nbsp;</li>\r\n</ul>\r\n<ul>\r\n<li>\r\n<p dir=\"ltr\">PR Coordinator - The PR coordinator is responsible for PPA's public image, community involvement, and membership recruitment. He or she coordinates MSC Open House, coordinates presentations to various organizations, collaborates&nbsp;with related organizations, and plans speakers for each meeting.</p>\r\n</li>\r\n</ul>\r\n<ul>\r\n<li>Media Designer - The media designer manages all PPA media. He/she creates Patriot Paws flyers and promotional items, and&nbsp;creates and administers the Power Point at each monthly meeting.</li>\r\n</ul>\r\n<ul>\r\n<li>Event Coordinator - The event coordinator plans and organizes all socials, creates the handout for general meetings, and creates a photo album or scrapbook at the end of each year.</li>\r\n</ul>\r\n<p>&nbsp;</p>\r\n<h1 class=\"x_x_x_title\">FAQ's</h1>\r\n<div class=\"x_x_x_row\">\r\n<div class=\"x_x_x_span12\">\r\n<div class=\"x_x_x_floating\">\r\n<div id=\"x_x_x_node-5\" class=\"x_x_x_node x_x_x_clear-block\">\r\n<div class=\"x_x_x_content\">\r\n<h1><strong>Q: How much does it cost to train a dog, and how does Patriot Paws get funding?</strong></h1>\r\n<p>A: Patriot Paws Service Dogs does not place a dog younger than 1 1/2 years. Training costs approximately $20,000 &ndash; $30,000; donations and volunteers are crucial.<strong>&nbsp;</strong>All of the money needed to care for the dogs-in-training is donated.</p>\r\n<h1><strong>Q: How do I apply for a service dog?<br /> </strong></h1>\r\n<p>A: Patriot Paws of Aggieland does not directly place service dogs with their veteran partners. To apply for a dog from Patriot Paws, visit patriotpaws.org. Go to the Service Dog tab, click on Application, and download the application form. Follow the instructions to fill it out, and begin the process of regaining your independence!</p>\r\n<h1><strong>Q: What is a service animal?</strong></h1>\r\n<p>A: The Americans with Disabilities Act (ADA) defines a service animal as any guide dog, signal dog, or other animal individually trained to provide assistance to an individual with a disability. Service animals perform some of the functions and tasks that the individual with a disability cannot perform for him or herself. A service animal is a medical device, not a pet. Service animals not only provide a specific service to their handlers, but also greatly enhance the quality of their lives with a new sense of freedom and independence.</p>\r\n<p>There are three types of Assistance Dogs:</p>\r\n<ul>\r\n<li>Guide Dogs: for the blind and the visually impaired</li>\r\n<li>Hearing Dogs: for the deaf and the hard of hearing</li>\r\n<li>Service Dogs: for people with disabilities other than those related to vision or hearing</li>\r\n</ul>\r\n<p>Dogs trained by Patriot Paws generally fall under the category of service dogs. Our dogs are trained for mobility assistance, post traumatic stress disorder, and seizure alert/response.</p>\r\n<h1><strong>Q: How do I get involved with Patriot Paws of Aggieland?</strong></h1>\r\n<p>A: Please visit the 'Get Involved' tab to learn more about how to become a member, puppy sitter, puppy raiser, or officer of PPA. The 'News' tab and our Facebook page provide details about upcoming PPA events.</p>\r\n<h1><strong>Q: Can I pet a service dog?</strong></h1>\r\n<p>A: Petting is at the handler's discretion. For service dogs in training, socialization is essential - so petting can be helpful, but only with the handler's approval. For working service dogs, petting is often is restricted since it may prevent the dog from doing his/her job correctly. Please do not be offended if a service dog handler does not allow you to pet their dog. Training comes first and foremost. Please do not ever pet a service dog without asking, and please do not call them to you, bark at them, or otherwise distract them! Interfering with or harrassing a service animal is prohibited under the ADA.</p>\r\n<h1><strong>Q: Why do your dogs get to go to class/restaurants/stores/etc?</strong></h1>\r\n<p>A: Under the ADA (federal law), service animals accompanied by their handlers have public access, but individual state laws regulate access for service dogs in training. Luckily, Texas state law provides service dogs in training with public access when accompanied by their trainer.</p>\r\n<p><em>Texas Human Resources Code, Chapter 121.003i</em></p>\r\n<p>An assistance animal in training shall not be denied admittance to any public facility when accompanied by an approved trainer who is an agent of an organization generally recognized by agencies involved in the rehabilitation of persons who are disabled as reputable and competent to provide training for assistance animals, and/or their handlers.&nbsp;</p>\r\n<p>For more information on Texas law regarding service animals, please visit http://www.statutes.legis.state.tx.us/docs/HR/htm/HR.121.htm</p>\r\n<p>For more information on the ADA regarding service animals, please visit http://www.ada.gov/qasrvc.htm</p>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>","summary":"Patriot Paws of Aggieland (PPA) is a group of dedicated individuals who assist in the training of service dogs for wounded veterans while simultaneously educating the public about service animals.","status":"Active","comment":null,"showJoin":true,"statusChangeDateTime":null,"startDate":"2014-04-02T00:00:00+00:00","endDate":null,"parentId":85092,"wallId":2366669,"discussionId":2366669,"groupTypeId":null,"organizationTypeId":2756,"cssConfigurationId":null,"deleted":false,"enableGoogleCalendar":false,"modifiedOn":"0001-01-01T00:00:00+00:00","socialMedia":{"ExternalWebsite":"","FlickrUrl":"","GoogleCalendarUrl":"","GooglePlusUrl":"","InstagramUrl":"","LinkedInUrl":"","PinterestUrl":"","TumblrUrl":"","VimeoUrl":"","YoutubeUrl":"","FacebookUrl":"https://www.facebook.com/PatriotPawsCS","TwitterUrl":null,"TwitterUserName":""},"profilePicture":"0ad27a95-f739-4380-a6a0-99e984d43080724d64d9-8007-4e7a-b8f0-f9fdb0866004.jpg","organizationType":{"id":2756,"name":"Registered - Recognized Student Organizations","autoApproveRequests":false,"showMembersToPublic":false,"showOfficersToPublic":true,"eventsEnabled":true,"serviceHoursEnabled":true,"financeEnabled":false,"reRegistrationAvailabilty":null,"electionsEnabled":true,"formsEnabled":true,"galleryEnabled":true,"outcomesEnabled":true,"rosterEnabled":true,"shownInPublicDirectory":true,"documentsEnabled":true,"isSystemType":false,"adminOnly":false},"primaryContact":{"id":"8daf16f3-4a44-4985-931b-a42c00cd6ef6","firstName":"Jacqueline","preferredFirstName":null,"lastName":"Fruit","primaryEmailAddress":"jackiefruit@tamu.edu","profileImageFilePath":null,"institutionId":3557,"privacy":"Unselected"},"isBranch":false,"contactInfo":[{"id":183474,"addressType":0,"city":null,"country":null,"deleted":false,"extension":null,"faxNumber":null,"organizationId":106400,"phoneNumber":null,"state":null,"street1":null,"street2":null,"zip":null}],"legacyKey":null,"parentLegacyKey":null,"legacyPrimaryContactKey":null,"showFacebookWall":false,"showTwitterFeed":false,"submissions":[],"visibility":"Public","isShownInPublicDirectory":true,"isAdminOnly":false,"categories":[]}