{"id":106354,"communityId":356,"institutionId":3557,"name":"American Constitution Society","shortName":"","nameSortKey":"A","websiteKey":"acs","email":"tamulawacs@gmail.com","description":"<p>The American Constitution Society for Law and Policy is a group of students concerned about the pervasive conservative orthodoxy in American law and politics. We believe deeply in the importance of law as the mechanism that governs the relationships between and among the individuals and institutions that form our society, and we recognize the direct relationship between legal theory and the broader political debate about the kind of society in which we live.</p>\r\n<p>In recent years, the view has been ascendant that the traditional values of compassion and respect for human dignity have little or no place in legal discourse. This view permeates all aspects of legal debate: academic scholarship, judicial interpretation, and debate about laws proposed for enactment. The cornerstone of this legal view is an approach to understanding the United States Constitution that is essentially devoid of concern for the way in which the law affects the lives of the people who make up the nation in which we live.</p>\r\n<p>We believe, contrary to this conservative orthodoxy, that the law, and, in particular, the Constitution, serves human values. We believe that the Constitution is a charter of liberty, the blueprint for a noble and unique experiment designed to prevent the excesses of government in order to protect the human dignity necessary for individuals to realize the full potential of their lives. The goal of the Constitution, and the United States it created, is to permit people to succeed in the \"pursuit of happiness,\" one of the inalienable rights this nation explicitly was founded to secure to the American people.</p>\r\n<p>We believe that the Constitution, and by extension, many other areas of American law, can be understood only by reference to principles of decency, reason, humanity and compassion. We believe that those who enforce the law must have concern for the way in which it affects the lives of the people who make up the nation in which we live. And we believe these principles should form a starting point for enactment, as well as interpretation, of the law.</p>","summary":"The Texas A&M University School of Law's chapter of the American Constitution Society, a progressive legal organization founded on the principle that the law should be a force to improve the lives of all people. ","status":"Active","comment":null,"showJoin":true,"statusChangeDateTime":null,"startDate":"2014-04-02T00:00:00+00:00","endDate":null,"parentId":85092,"wallId":2366580,"discussionId":2366580,"groupTypeId":null,"organizationTypeId":2756,"cssConfigurationId":null,"deleted":false,"enableGoogleCalendar":false,"modifiedOn":"0001-01-01T00:00:00+00:00","socialMedia":{"ExternalWebsite":"","FlickrUrl":"","GoogleCalendarUrl":"","GooglePlusUrl":"","InstagramUrl":"","LinkedInUrl":"","PinterestUrl":"","TumblrUrl":"","VimeoUrl":"","YoutubeUrl":"","FacebookUrl":null,"TwitterUrl":null,"TwitterUserName":""},"profilePicture":null,"organizationType":{"id":2756,"name":"Registered - Recognized Student Organizations","autoApproveRequests":false,"showMembersToPublic":false,"showOfficersToPublic":true,"eventsEnabled":true,"serviceHoursEnabled":true,"financeEnabled":false,"reRegistrationAvailabilty":null,"electionsEnabled":true,"formsEnabled":true,"galleryEnabled":true,"outcomesEnabled":true,"rosterEnabled":true,"shownInPublicDirectory":true,"documentsEnabled":true,"isSystemType":false,"adminOnly":false},"primaryContact":{"id":"afc5ea84-6ee5-4efd-91ab-1f36f733d560","firstName":"Taylor","preferredFirstName":null,"lastName":"Allan","primaryEmailAddress":"tallan1@tamu.edu","profileImageFilePath":null,"institutionId":3557,"privacy":"Unselected"},"isBranch":false,"contactInfo":[{"id":183428,"addressType":0,"city":"Fort Worth","country":"United States","deleted":false,"extension":null,"faxNumber":null,"organizationId":106354,"phoneNumber":null,"state":"TX","street1":"1515 Commerce St.","street2":null,"zip":"76102"}],"legacyKey":null,"parentLegacyKey":null,"legacyPrimaryContactKey":null,"showFacebookWall":false,"showTwitterFeed":false,"submissions":[],"visibility":"Public","isShownInPublicDirectory":true,"isAdminOnly":false,"categories":[]}