{"id":93949,"communityId":356,"institutionId":3557,"name":"Alpha Pi Mu - Industrial Engineering Honor Society","shortName":"APM","nameSortKey":"A","websiteKey":"apm","email":"tamuapm@gmail.com","description":"<p><strong>Purpose</strong></p>\r\n<p>The Alpha Pi Mu Honor Society aims to:&nbsp;</p>\r\n<p>Confer recognition upon students of Industrial and Systems Engineering who have shown exceptional academic interest and abilities in their field, encourage the advancement and quality of Industrial and Systems Engineering education, unify the student body of the Industrial Engineering department in presenting its needs and ideals to the faculty.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Eligibility</strong></p>\r\n<p>Students of Industrial and Systems Engineering programs who rank in the upper one-third of the senior Industrial and Systems Engineering class and the upper one-fifth of the junior Industrial and Systems Engineering class are considered for membership on the basis of leadership, ethics, sociability, character, and breadth of interest. Graduate students and alumni may be elected to membership if they meet the requirements. Faculty members and professional industrial and systems engineers may be elected to faculty and honorary membership respectively have proven themselves outstanding professionals in the field.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><strong>The History of Alpha Pi Mu</strong></p>\r\n<p>The founder of Alpha Pi Mu was James T. French, who in 1949 was a senior industrial engineering student at Georgia Tech. Nine men chosen through their affiliation with the Georgia Tech Chapter of Tau Beta Pi constituted the original membership of Alpha Pi Mu. Alpha Pi Mu is the only nationally accepted industrial engineering honor society. The Georgia Tech engineers who led the initial developmental work wanted an organization to provide a common ground \"on which their outstanding young engineers could exchange ideas,\" and to provide experiences which could help their future professional development.&nbsp;</p>\r\n<p>Alpha Pi Mu became a member of the ACHS in 1959.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>The Goals of Alpha Pi Mu</strong></p>\r\n<p>According to its bylaws, the Goals of Alpha Pi Mu are:</p>\r\n<ul>\r\n<li>To confer recognition upon industrial engineering student who has shown exceptional academic interests and abilities in his field.&nbsp;</li>\r\n<li>To encourage wherever possible any movement which will advance the best interest of industrial engineering education.</li>\r\n<li>To further unify the student body of the Industrial Engineering Department in presenting its needs and ideals to the faculty.&nbsp;</li>\r\n<li>To create a closer student-faculty relationship by bringing together the needs and thoughts of both.&nbsp;</li>\r\n<li>To assist and cooperate with all organizations and persons working for the interest of industrial engineering.</li>\r\n<li>To benefit its members by the association and experience that can come from bringing together a group with similar interests, objectives, and abilities.&nbsp;</li>\r\n<li>To promote the professional welfare of all.&nbsp;</li>\r\n</ul>\r\n<p>&nbsp;</p>","summary":null,"status":"Active","comment":null,"showJoin":true,"statusChangeDateTime":null,"startDate":"2013-08-08T00:00:00+00:00","endDate":null,"parentId":85092,"wallId":1355121,"discussionId":1355121,"groupTypeId":null,"organizationTypeId":2756,"cssConfigurationId":null,"deleted":false,"enableGoogleCalendar":false,"modifiedOn":"0001-01-01T00:00:00+00:00","socialMedia":{"ExternalWebsite":"http://apm.tamu.edu","FlickrUrl":"","GoogleCalendarUrl":"","GooglePlusUrl":"","InstagramUrl":"","LinkedInUrl":"","PinterestUrl":"","TumblrUrl":"","VimeoUrl":"","YoutubeUrl":"","FacebookUrl":null,"TwitterUrl":"","TwitterUserName":""},"profilePicture":null,"organizationType":{"id":2756,"name":"Registered - Recognized Student Organizations","autoApproveRequests":false,"showMembersToPublic":false,"showOfficersToPublic":true,"eventsEnabled":true,"serviceHoursEnabled":true,"financeEnabled":false,"reRegistrationAvailabilty":null,"electionsEnabled":true,"formsEnabled":true,"galleryEnabled":true,"outcomesEnabled":true,"rosterEnabled":true,"shownInPublicDirectory":true,"documentsEnabled":true,"isSystemType":false,"adminOnly":false},"primaryContact":{"id":"b47ff14b-ee56-45f9-8d8e-a658011fe348","firstName":"Daniel","preferredFirstName":null,"lastName":"Roof","primaryEmailAddress":"daniel.roof@tamu.edu","profileImageFilePath":null,"institutionId":3557,"privacy":"Unselected"},"isBranch":false,"contactInfo":[{"id":171197,"addressType":0,"city":"College Station","country":"United States","deleted":false,"extension":null,"faxNumber":null,"organizationId":93949,"phoneNumber":null,"state":"TX","street1":null,"street2":null,"zip":"77840"}],"legacyKey":null,"parentLegacyKey":null,"legacyPrimaryContactKey":null,"showFacebookWall":false,"showTwitterFeed":false,"submissions":[],"visibility":"Public","isShownInPublicDirectory":true,"isAdminOnly":false,"categories":[]}