{"id":88968,"communityId":356,"institutionId":3557,"name":"Freshmen Liberal Arts Reaching Excellence","shortName":"FLARE","nameSortKey":"F","websiteKey":"flare","email":"tamuflaredirectors@gmail.com","description":"<p><span style=\"text-decoration: underline;\"><strong>What is FLARE?</strong></span></p>\r\n<p>FLARE (Freshmen in Liberal Arts Reaching Excellence) was founded in 2008 as a FLO (Freshmen Leadership Organization) to provide freshmen Liberal Arts majors the opportunity to develop both academically and socially within the Texas A&amp;M College of Liberal Arts. FLARE provides freshmen with the tools and resources to become stronger leaders, both on campus and within the Bryan-College Station community.</p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"text-decoration: underline;\"><strong>Our Purpose:</strong></span></p>\r\n<p>FLARE aims to create a welcoming environment for freshmen to gain exposure to the College of Liberal Arts, promote unity among liberal arts majors, create unique educational experiences outside of the classroom, promote and support diversity throughout the student body, coordinate events for liberal arts students, and to represent the College of Liberal Arts through community service projects.</p>\r\n<p><br /> <span style=\"text-decoration: underline;\"><strong>How FLARE Works:</strong></span><br /> <br /> FLARE is composed of 3 junior directors, 11-14 sophomore counselors and 50-60 freshmen members. All staff members have been a part of FLARE previously. Our size enables us to create a dynamic environment for freshmen to make a big impact within the Texas A&amp;M community and foster strong friendships within the organization.&nbsp;<br /> <br /> General meetings are held at 7:00pm every Tuesday night. During this time FLARE comes together to develop as a group. This is usually accomplished by inviting guest speakers who have valuable lessons to offer to our enrichment. Past speakers have included the Dean of Liberal Arts, James Olson from the Bush School, and many professors from the College of Liberal Arts. We also use this time to allow committees to update the organization on their projects and to keep FLARE connected as a whole.</p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"text-decoration: underline;\"><strong>Committees:&nbsp;</strong></span><br /> Freshmen are placed into one of five committees, each headed by two chairs/counselors. This allows for each member to work on projects that are specific to their interests.&nbsp;</p>\r\n<p style=\"text-align: left;\">The <strong>Public Relations (PR)​</strong> committee deals with maintaining FLARE&rsquo;s image on various social<br /> media platforms, designing, ordering, collecting funds, and maintaining communication with<br /> manufacturers of FLARE apparel. PR is also responsible for co-planning and co-organizing the<br /> Spring Semester all-FLO event.</p>\r\n<p style=\"text-align: left;\"><br /> The <strong>Internal Relations (IR)</strong> ​committee works to keep all FLARE members connected by<br /> planning and putting on our socials! We also work to build and strengthen friendships between<br /> flarians by working with the buddy system and ensuring that everyone feels included. We also<br /> collaborate with the directors for Fall and Spring Retreats to showcase our members at the end<br /> of each semester.</p>\r\n<p style=\"text-align: left;\">&nbsp;</p>\r\n<p style=\"text-align: left;\"><strong>Special Activities and Fundraising​</strong> deals with planning and overseeing important events for<br /> FLARE, including Parents Night and the Winter Formal, as well as attending to all matters<br /> involving raising money for the FLO throughout the year by various means, including organizing<br /> profit shares with local restaurants.</p>\r\n<p style=\"text-align: left;\"><br /> The <strong>Community Outreach committee (COMOUT)​</strong> in FLARE is (as the name implies) the<br /> service committee. We coordinate volunteering opportunities for our FLARE members and help<br /> our organization improve the university and Bryan/College Station area. Internally we help<br /> FLARE members make new connections within FLARE as well as the university as a whole.</p>\r\n<p style=\"text-align: left;\"><br /> The <strong>Cultural Inclusion and Academics (CIA)​</strong> committee is in charge of providing<br /> academic support and cultural exploration for liberal arts students within FLARE. We help<br /> students excel in the classroom and the university by bringing faculty, organizations, and other<br /> inspirational speakers to discuss opportunities a Liberal Arts degree has. Along with hosting<br /> study hours throughout the week, we plan day trips for the purpose of cultural enrichment,<br /> including outings to traditional Aggie events.</p>\r\n<p style=\"text-align: left;\">&nbsp;</p>\r\n<p style=\"text-align: left;\"><span style=\"text-decoration: underline;\"><strong>Social Activities:</strong></span><br /> For the social aspect of FLARE, each member is placed into a family.&nbsp;Families are led by two counselors and are small groups that enable the freshmen to meet others in FLARE outside of their committee. These groups hangout together and do various activities and competitions throughout the semester that enable growth and fun.&nbsp;</p>\r\n<p style=\"text-align: left;\">Tons of extra activities are offered throughout the year to give flarians a chance to relax and have fun together. Many socials are put on as well as a Fall and Spring Retreat and a Winter Formal. Groups often go together to movie nights and RenFest or host Girls and Guys nights. We also participate in FLO-Bowl (powderpuff football) and Bump Set FLO (our annual All-FLO Volleyball tournament) and are always open to more activities!</p>\r\n<p style=\"text-align: left;\">&nbsp;</p>\r\n<p style=\"text-align: left;\">&nbsp;</p>\r\n<p style=\"text-align: left;\"><strong>FLARE will be hosting informationals:</strong></p>\r\n<p style=\"text-align: left;\">Monday, Sept. 4th 7pm MSC 2405<br /> Tuesday, Sept. 5th 7pm ANTH 237</p>\r\n<p>Come out and learn about all of the opportunities our student organization has to give! Feel free to contact us at tamuflaredirectors@gmail.com with any questions and check out our Instagram (<a href=\"https://www.instagram.com/flarestagram/\">@flarestagram</a>) and Twitter (<a href=\"https://twitter.com/tamuflare?lang=en\">@tamuflare</a>). We look forward to meeting everyone! :)</p>","summary":"To provide freshmen Liberal Arts majors with an environment to develop academically and socially within their college and create an opportunity for freshmen to become involved with the College of Liberal Arts through leadership positions....","status":"Active","comment":null,"showJoin":true,"statusChangeDateTime":null,"startDate":"2013-07-01T00:00:00+00:00","endDate":null,"parentId":85092,"wallId":1302347,"discussionId":1302347,"groupTypeId":null,"organizationTypeId":2752,"cssConfigurationId":null,"deleted":false,"enableGoogleCalendar":false,"modifiedOn":"0001-01-01T00:00:00+00:00","socialMedia":{"ExternalWebsite":"http://maroonlink.tamu.edu/organization/flare","FlickrUrl":"","GoogleCalendarUrl":"","GooglePlusUrl":"","InstagramUrl":"https://www.instagram.com/flarestagram/","LinkedInUrl":"","PinterestUrl":"","TumblrUrl":"","VimeoUrl":"","YoutubeUrl":"","FacebookUrl":null,"TwitterUrl":null,"TwitterUserName":"tamuflare"},"profilePicture":"bf16d8e7-b457-4676-8e67-c2dc1ab3925ad588d888-145c-4b98-ac5d-3fc2ec837932.jpeg","organizationType":{"id":2752,"name":"Affiliated - Recognized Student Organizations","autoApproveRequests":false,"showMembersToPublic":false,"showOfficersToPublic":true,"eventsEnabled":true,"serviceHoursEnabled":true,"financeEnabled":false,"reRegistrationAvailabilty":null,"electionsEnabled":true,"formsEnabled":true,"galleryEnabled":true,"outcomesEnabled":true,"rosterEnabled":true,"shownInPublicDirectory":true,"documentsEnabled":true,"isSystemType":false,"adminOnly":false},"primaryContact":{"id":"ff5c61fa-6e18-44ad-b220-a67a009cf029","firstName":"Victoria","preferredFirstName":null,"lastName":"Millen","primaryEmailAddress":"vmillen1998@tamu.edu","profileImageFilePath":null,"institutionId":3557,"privacy":"Unselected"},"isBranch":false,"contactInfo":[{"id":166345,"addressType":0,"city":null,"country":null,"deleted":false,"extension":null,"faxNumber":null,"organizationId":88968,"phoneNumber":null,"state":null,"street1":null,"street2":null,"zip":null}],"legacyKey":null,"parentLegacyKey":null,"legacyPrimaryContactKey":null,"showFacebookWall":false,"showTwitterFeed":false,"submissions":[],"visibility":"Public","isShownInPublicDirectory":true,"isAdminOnly":false,"categories":[]}