{"id":89130,"communityId":356,"institutionId":3557,"name":"Kappa Sigma","shortName":"Kappa Sig","nameSortKey":"K","websiteKey":"kappasig","email":null,"description":"<p>&nbsp;The Kappa Sigma Fraternity can trace its roots back to a secret society of students at the University of Bologna formed in the year 1400 for mutual protection of its members. The group was initially brought together by Manuel Chrysaloras, a Greek scholar that taught at the University, in response to physical attack, robbery and harassment of the University's patrons. It was this group that inspired the Ritual and beliefs of modern day Kappa Sigma.</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Kappa&nbsp;Sigma in America was founded one chilly evening in the fall of 1869, as&nbsp;five students&nbsp;attending the&nbsp;University of Virginia&nbsp;in&nbsp;Charlottesville&nbsp;gathered in&nbsp;William Grigsby McCormick's room at 46 East Lawn and planted the seed of Brotherhood. For many weeks the bonds of friendship&nbsp;had drawn these five together; now the need became clear for a formal structure to contain their feelings. Thus, not only did the Founders formalize their friendship, but they also created a fraternity steeped in the traditions of the past and dedicated to the Pursuit of Learning. The new brothers recorded their bond in a Constitution and in an Oath which set forth.</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Over time, Kappa Sigma chapters spread across the nation, producing good men with an indelible bond between one another. In 1880, Kappa Sigma established Alpha-Chi Chapter at Lake Forest College in Lake Forest, Illinois. This was the first northern chapter of a fraternity of southern origin. Five years later, expansion into the North began in earnest with Chi Chapter at Purdue University in 1885, and Psi Chapter at the University of Maine in 1886. Expansion to the West started in 1884 with Tau Chapter at the University of Texas and reached the Pacific coast in 1899 with Beta-Zeta Chapter at Stanford University.</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In 1924, Kappa Sigma chartered its first Canadian chapter, Delta-Epsilon, at the University of Toronto in Ontario, and became an international Fraternity. With the acquisition in 1966 of&nbsp;<a href=\"http://www.kappasigma.org/\" target=\"_new\">International Memorial Headquarters</a>&nbsp;at Charlottesville, Virginia, near the birthplace of American Kappa Sigma, a new and progressive concept of a professional staff developed. At this point, the Fraternity began experiencing growth that had not been seen since its inception nearly a hundred years prior, and has continued to this day.&nbsp;</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Today, Kappa Sigma comprises over 200 chapters and colonies in both the United States and Canada, with over 200,000 men. Kappa Sigma is the sixth largest fraternity and has approximately 150,000 brothers in North America. The list of initiates is not only long, but also distinguished.&nbsp;Notable alumni&nbsp;are present in every conceivable profession and are making great impressions on the American landscape.</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Fraternity now exists now not only as singular chapters, but as an institution that has many mechanisms to support itself and foster growth, coordinated by the hundreds of volunteers nationwide. Every other year (odd years) the Fraternity stages a Grand Conclave for all initiates to come together and celebrate the accomplishments of the Brotherhood. Recent Conclaves have taken place in New Orleans, Pheonix and Memphis; the next one is scheduled for 2003 in Tampa, Florida. At these conventions, as with the regional Leadership Conferences that take place in off years, undergraduates are instructed in basic chapter operations and encouraged to share ideas in order to build a stronger presence at each and every campus where Kappa Sigma is located. These educational programs are funded by the Kappa Sigma Endowment Fund, which also disperses $250,000 in scholarships each year to deserving undergraduates through the the Scholarship/Leadership Program.</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; It is evident from Kappa Sigma's past that the Fraternity is focused on being the top such organization in the nation through building an educated brotherhood of young men with the leadership skills necessary to succeed in all aspects of life.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>The future&nbsp;looks bright for the Men of the Kappa Sigma Fraternity.</p>","summary":"The Kappa Sigma fraternity is a mens organization on the Texas A&M campus. This organization is based on strong moral values consisting of Selfless Service, Brotherhood and Integrity.  ","status":"Active","comment":null,"showJoin":true,"statusChangeDateTime":null,"startDate":"2013-07-01T00:00:00+00:00","endDate":null,"parentId":85092,"wallId":1302509,"discussionId":1302509,"groupTypeId":null,"organizationTypeId":2752,"cssConfigurationId":null,"deleted":false,"enableGoogleCalendar":false,"modifiedOn":"0001-01-01T00:00:00+00:00","socialMedia":{"ExternalWebsite":"http://www.aggiekappasig.org/","FlickrUrl":"","GoogleCalendarUrl":"","GooglePlusUrl":"","InstagramUrl":"","LinkedInUrl":"","PinterestUrl":"","TumblrUrl":"","VimeoUrl":"","YoutubeUrl":"","FacebookUrl":"https://www.facebook.com/MuGammaDistractedDriving","TwitterUrl":null,"TwitterUserName":""},"profilePicture":"1186ce24-15e4-4f70-92df-0cf8f10e043f69b60ac3-ea27-4cba-873d-5a241d696731.jpg","organizationType":{"id":2752,"name":"Affiliated - Recognized Student Organizations","autoApproveRequests":false,"showMembersToPublic":false,"showOfficersToPublic":true,"eventsEnabled":true,"serviceHoursEnabled":true,"financeEnabled":false,"reRegistrationAvailabilty":null,"electionsEnabled":true,"formsEnabled":true,"galleryEnabled":true,"outcomesEnabled":true,"rosterEnabled":true,"shownInPublicDirectory":true,"documentsEnabled":true,"isSystemType":false,"adminOnly":false},"primaryContact":{"id":"3dad5e67-7e98-4e19-92bd-a67801293c9b","firstName":"Chase","preferredFirstName":null,"lastName":"Brown","primaryEmailAddress":"chasebrown42@tamu.edu","profileImageFilePath":null,"institutionId":3557,"privacy":"Unselected"},"isBranch":false,"contactInfo":[{"id":166507,"addressType":0,"city":"College Station","country":"US","deleted":false,"extension":null,"faxNumber":null,"organizationId":89130,"phoneNumber":null,"state":"TX","street1":"4466 Raymond Stotzer Parkway ","street2":null,"zip":"77845"}],"legacyKey":null,"parentLegacyKey":null,"legacyPrimaryContactKey":null,"showFacebookWall":false,"showTwitterFeed":false,"submissions":[],"visibility":"Public","isShownInPublicDirectory":true,"isAdminOnly":false,"categories":[]}