{"id":89566,"communityId":356,"institutionId":3557,"name":"Texas A&M SEDS","shortName":"Texas A&M SEDS","nameSortKey":"T","websiteKey":"tamuseds","email":"tamu@chapter.seds.org","description":"SEDS members are people interested in doing as much as they can to promote space exploration and development. The first step in this continual process is learning. SEDS provides an excellent environment in which to obtain access to many sources of information including speakers, tours, films, and discussion groups. Astronomy observing trips and tours of local space facilities also play a significant role in the life of many SEDS members. <br><br>SEDS members often take the knowledge they have gained and use it to influence the future of the space program. Students at several chapters have played major roles in organizing large conferences and have established important contacts with members of the space community. Others have helped increase public awareness of the benefits of space exploration by offering presentations to local primary and secondary schools as well as universities.<br><br>The Texas A&M chapter is one of the most active SEDS chapters on both the national and local level. Several of our members are current or former national SEDS executive board members. Members have been involved in the International Year of Astronomy, AIAA, the Space Frontier Foundation, The Planetary Society, and many other space-related organizations. Our SEDS chapter has also competed and placed in several engineering design competitions. SEDS is also actively involved in planning and helping with Yuri's Night Houston. Our chapter also hosts social nights where our members get together and play space-themed games or watch space-themed movies. Our chapter also tours SpaceX, Johnson Space Center, Southwest Research Institute, and many other space-themed companies on a regular basis. Our SEDS chapter also always sends students to the annual national SEDS conference, SpaceVision.<br><br>Our members are mostly science and engineering majors, but anyone with a passion for space is welcome.","summary":"SEDS members are people interested in doing as much as they can to promote space exploration and development. The first step in this continual process is learning. SEDS provides an excellent environment in which to obtain access to many sources of info...","status":"Active","comment":null,"showJoin":true,"statusChangeDateTime":null,"startDate":"2013-07-01T00:00:00+00:00","endDate":null,"parentId":85092,"wallId":1303271,"discussionId":1303271,"groupTypeId":null,"organizationTypeId":2756,"cssConfigurationId":null,"deleted":false,"enableGoogleCalendar":false,"modifiedOn":"0001-01-01T00:00:00+00:00","socialMedia":{"ExternalWebsite":"http://chapters.seds.org/tamu","FlickrUrl":"","GoogleCalendarUrl":"","GooglePlusUrl":"","InstagramUrl":"","LinkedInUrl":"","PinterestUrl":"","TumblrUrl":"","VimeoUrl":"","YoutubeUrl":"","FacebookUrl":"","TwitterUrl":"","TwitterUserName":null},"profilePicture":null,"organizationType":{"id":2756,"name":"Registered - Recognized Student Organizations","autoApproveRequests":false,"showMembersToPublic":false,"showOfficersToPublic":true,"eventsEnabled":true,"serviceHoursEnabled":true,"financeEnabled":false,"reRegistrationAvailabilty":null,"electionsEnabled":true,"formsEnabled":true,"galleryEnabled":true,"outcomesEnabled":true,"rosterEnabled":true,"shownInPublicDirectory":true,"documentsEnabled":true,"isSystemType":false,"adminOnly":false},"primaryContact":{"id":"223f0ffe-8997-4889-abaf-a3db01325926","firstName":"Makiah","preferredFirstName":null,"lastName":"Eustice","primaryEmailAddress":"mckaynicole@tamu.edu","profileImageFilePath":null,"institutionId":3557,"privacy":"Unselected"},"isBranch":false,"contactInfo":[{"id":166935,"addressType":0,"city":null,"country":null,"deleted":false,"extension":null,"faxNumber":null,"organizationId":89566,"phoneNumber":null,"state":null,"street1":null,"street2":null,"zip":null}],"legacyKey":null,"parentLegacyKey":null,"legacyPrimaryContactKey":null,"showFacebookWall":false,"showTwitterFeed":false,"submissions":[],"visibility":"Public","isShownInPublicDirectory":true,"isAdminOnly":false,"categories":[]}