{"id":89516,"communityId":356,"institutionId":3557,"name":"A&M Photography Club","shortName":"VI Photography","nameSortKey":"A","websiteKey":"photography_club","email":"photographyclub.tamu@gmail.com","description":"<p><strong>Please do not press the <em>membership request button</em>. </strong></p>\r\n<p><strong>Applications/Membership is now closed for the Fall 2018 semester.</strong></p>\r\n<p>This organization is aimed towards A&amp;M students who enjoy photography and taking pictures as a lifestyle. A&amp;M Photography Club provides a more interconnected campus social network through photo sharing and collaboration among A&amp;M students and A&amp;M student groups while promoting awareness of the enriching opportunities available to all students. We intend to enrich the Aggie experience by organizing a photography network of students who enjoy taking pictures and making their photos easily accessible for the enjoyment of everyone in the A&amp;M community. <strong>If you are looking to join the club or hire us, please be sure to sign into Maroonlink to unlock the forms tab to fill out the respected form. The forms also do not appear for Safari users, so please use a different web browser.</strong></p>\r\n<p>&nbsp;</p>\r\n<p><strong>Weekly Meetings</strong></p>\r\n<p><em>Time:</em> Mondays 7 PM - 8 PM</p>\r\n<p><em>Place:</em>&nbsp;Rudder Tower</p>\r\n<p>Room&nbsp;number will be announced by e-mail before each meeting.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Excursions</strong></p>\r\n<p>There are both in-town and out-of-town excursions throughout the semester. It is a good opportunity to practice what you have learned during the weekly meetings. Excursions usually take place every weekend. Exact times are announced in advance via e-mail and Facebook.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Dues</strong></p>\r\n<p><em>Amount:</em> $40</p>\r\n<p><em>Deadline:</em>&nbsp;9/24/2018</p>\r\n<p>If you do not pay, you will have to apply again the next semester. In the case you are unable to pay dues due to financial constraints, please&nbsp;contact us.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Membership Requirements</strong></p>\r\n<p>Participate in meetings and activities and have fun.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Meet your 2017-2018 Officers!</strong></p>\r\n<p><strong>President </strong><strong>-&nbsp;</strong><strong>Chase Zamulinski</strong></p>\r\n<p>Howdy, my name is Chase Zamulinski, and I am a Senior Electrical Engineer. I'm a SkillsUSA 2015 National Champion photographer. I've learned how to create professional results from close to nothing, so don't hesitate to shoot me a question. I primarily shoot Nikon, and I&nbsp;currently have a Nikon d3200, a Nikon d5500, a Nikon d800, Fujifilm x100s, and a few film cameras. My special niche in photography is portraiture and fashion.</p>\r\n<p><strong>VP &amp;&nbsp;</strong><strong>Treasurer - Byron Mitchell</strong></p>\r\n<p>Howdy, My name is Byron Mitchell, and I am a senior Communication student. I began photography in high school using a point and shoot. I finally purchased a medium range dslr (my Canon t5) about a year ago. I don't fancy myself an amazing photographer, but I'm willing to work on myself and help others when possible. If you need anything let me know. I hope you learn a lot in this club.</p>\r\n<p><strong>Event/Activity Planner - Cooper McCain</strong></p>\r\n<p>Howdy! My name is Cooper McCain, and I&rsquo;m a senior Industrial Distribution major. I&rsquo;ve always loved to take photos ever since I was a kid. However, it wasn&rsquo;t until last January when I got my first camera, a Nikon D5500. Today I shoot with my beloved Nikon D750. I don&rsquo;t stick to any type of photography, as I pretty much take photos in spontaneous moments when I see something breathtaking, including my girlfriend. Today, I typically find myself taking photos of landscapes, weather, the night sky, and anything else nature related because nature is what I&rsquo;ve always loved to photograph most.</p>\r\n<p><strong>Creativity Director - Jose Almazan</strong></p>\r\n<p>Howdy! I&rsquo;m Jose Almazan, and I am a senior University Studies in Architecture major from Laredo, Texas. At first, photography was just an escape from day to day life in high school. However, after a while of immersing myself in the history, books, and videos I began to take it more serious and developed it into a hobby. A few months after graduation I picked up my first DSLR and later my first film camera. Since then I&rsquo;ve devoted a large portion of my time to learn as much as I can about photography and honing my skills to help others interested in the craft. Currently, I use both digital and film (primarily Sony A7III and Nikon FE) and will shoot anything from Astro to Portraits to Landscapes and Abstracts.</p>\r\n<p><strong>Member Outreach/Historian - Brittany Baysinger</strong></p>\r\n<p>Howdy! My name is Brittany Baysinger, I am a senior Communications &amp; Journalism major. I have been doing photography for 3 years, and I am excited to keep learning along with y&rsquo;all! I shoot mainly on a Canon, but I can always help you out with your camera if you need it. I specialize in macro and nature, but I try to work in all forms of photography! I can&rsquo;t wait to get to know y&rsquo;all better; and as your member outreach officer, please always feel free to say howdy <img class=\"x_x_x_x__1ift x_x_x_x__2560 x_x_x_x_img\" src=\"https://static.xx.fbcdn.net/images/emoji.php/v9/fa5/1.5/16/1f642.png\" alt=\"🙂\" /> My goal for the club is to help foster new connections and friendships among the students and peers of the photography field. Welcome to the club!</p>\r\n<p><strong>Member Outreach/Historian - Ian Paul Terry</strong></p>\r\n<p>Howdy,&nbsp;my name is Ian Paul Terry, and I&rsquo;m a Junior studying Finance here at TAMU. I picked up a Nikon d3400 July of 2017 because I wanted to take better pictures of my cat, and now I specialize in portraiture and weddings! I&rsquo;d consider myself more of a creative photographer because I love thinking outside the box and using very simple things to make very cool effects! If you need help with figuring out how to use your lenses, shooting with models, or editing, feel free to contact me!</p>","summary":"This organization is aimed towards A&M students who enjoy photography and taking pictures as a lifestyle. A&M Photo Club provides a more interconnected campus social network through photo sharing and collaboration among A&M students and A&M studen...","status":"Active","comment":null,"showJoin":true,"statusChangeDateTime":null,"startDate":"2013-07-01T00:00:00+00:00","endDate":null,"parentId":85092,"wallId":1302895,"discussionId":1302895,"groupTypeId":null,"organizationTypeId":2756,"cssConfigurationId":null,"deleted":false,"enableGoogleCalendar":false,"modifiedOn":"0001-01-01T00:00:00+00:00","socialMedia":{"ExternalWebsite":"","FlickrUrl":"","GoogleCalendarUrl":"https://calendar.google.com/calendar/embed?src=photographyclub.tamu%40gmail.com&ctz=America/Chicago","GooglePlusUrl":"","InstagramUrl":"https://www.instagram.com/photographyclubtamu/","LinkedInUrl":"","PinterestUrl":"","TumblrUrl":"","VimeoUrl":"","YoutubeUrl":"","FacebookUrl":"http://www.facebook.com/TAMUPHOTOCLUB","TwitterUrl":null,"TwitterUserName":"photoclubtamu"},"profilePicture":"bb9f8865-b5d9-4332-a53d-d69a3057aa630c69fd91-ea7f-44c2-8f45-6e9f9af2e36e.png","organizationType":{"id":2756,"name":"Registered - Recognized Student Organizations","autoApproveRequests":false,"showMembersToPublic":false,"showOfficersToPublic":true,"eventsEnabled":true,"serviceHoursEnabled":true,"financeEnabled":false,"reRegistrationAvailabilty":null,"electionsEnabled":true,"formsEnabled":true,"galleryEnabled":true,"outcomesEnabled":true,"rosterEnabled":true,"shownInPublicDirectory":true,"documentsEnabled":true,"isSystemType":false,"adminOnly":false},"primaryContact":{"id":"5a02d546-5693-4581-8bf2-a513013c2efe","firstName":"Chase","preferredFirstName":null,"lastName":"Zamulinski","primaryEmailAddress":"z6572125@tamu.edu","profileImageFilePath":null,"institutionId":3557,"privacy":"Unselected"},"isBranch":false,"contactInfo":[{"id":166893,"addressType":0,"city":null,"country":null,"deleted":false,"extension":null,"faxNumber":null,"organizationId":89516,"phoneNumber":null,"state":null,"street1":null,"street2":null,"zip":null}],"legacyKey":null,"parentLegacyKey":null,"legacyPrimaryContactKey":null,"showFacebookWall":false,"showTwitterFeed":false,"submissions":[],"visibility":"Public","isShownInPublicDirectory":true,"isAdminOnly":false,"categories":[]}